app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "study_group"], ["LIMIT", 1]]
---
  def add_category_to_post
    @category = Category.find_by name: (params[:category])