app/controllers/posts_controller.rb

  def showUsersPosts
    @user = User.find(params[:user_id])
    @posts = Post.where user: @user
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.user = @current_user
    @post.category = @category
    if @post.save
---
INSERT INTO "posts" ("title", "content", "skills", "user_id", "category_id", "created_at", "updated_at", "looking_for") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "content" = $2, "skills" = $3, "updated_at" = $4, "looking_for" = $5 WHERE "posts"."id" = $6  [["title", "Edited"], ["content", "Edited"], ["skills", "Edited"], ["updated_at", "2021-10-06 03:07:21.011205"], ["looking_for", "Back-end"], ["id", 37]]