app/controllers/users_controller.rb

UPDATE "users" SET "username" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["username", "test3"], ["email", "test3@emaill.com"], ["password_digest", "$2a$12$hk1/gTyEqiR/6IbGTFzz.uI9cOdEIDtABpInnnInmTnQ.PhYwZNSi"], ["updated_at", "2021-10-04 23:45:56.549104"], ["id", 2]]
---
  def update
    if @user.update(user_params)